### Creating dataframes using different methods

In [1]:
import pandas as pd
import numpy as np

#### Finding Data Types

In [3]:
Series1 = pd.Series(['Arun','Biben','Geo','Joyal'])
print(Series1.dtype)

object

#### Converting to List

In [4]:
print(Series1.to_list())

['Arun', 'Biben', 'Geo', 'Joyal']

### Pandas DataFrame
A Pandas dataframe is a tabular data structure that stores data in the form of rows and columns.
As a standard, the rows correspond to records while columns refer to attributes. In simplest
words, a Pandas dataframe is a collection of series.

#### Empty dataframe

In [5]:
my_df = pd.DataFrame()
print(my_df)

Empty DataFrame
Columns: []
Index: []

#### 1. Dataframe using list of lists

In [21]:
Ages = [['Arun',26,'Male'],['Biben',25,'Male'],['Geo',25,'Male'],['Joyal',26,'Male'],['Shenfer',24],['Shebin',24,'Male'],['Arya',26,'Female']]

In [22]:
my_df = pd.DataFrame(Ages,columns =['Name','Ages','Gender'])
my_df

      Name  Ages  Gender
0     Arun    26    Male
1    Biben    25    Male
2      Geo    25    Male
3    Joyal    26    Male
4  Shenfer    24    None
5   Shebin    24    Male
6     Arya    26  Female

#### 2. DataFrame using dictionaries

In [19]:
Ages = {'Names':['Arun','Biben','Geo','Joyal','Shenfeer','Shebin','Arya'],
       'Ages':[26,25,25,26,24,24,26],
    'Gender':['Male','Male','Male','Male','Male','Male','Female']}

In [20]:
my_df = pd.DataFrame(Ages)
my_df

      Names  Ages  Gender
0      Arun    26    Male
1     Biben    25    Male
2       Geo    25    Male
3     Joyal    26    Male
4  Shenfeer    24    Male
5    Shebin    24    Male
6      Arya    26  Female

#### 3. Dataframe using list of dictionaries

In [17]:
Ages = [{'Names': 'Arun','Age':26,'Gender':'Male'},
       {'Names': 'Biben','Age':25,'Gender':'Male'},
       {'Names': 'Geo','Age':25,'Gender':'Male'},
       {'Names': 'Joyal','Age':26,'Gender':'Male'},
       {'Names': 'Shenfeer','Age':24,'Gender':'Male'},
       {'Names': 'Shebin','Age':24,'Gender':'Male'},
       {'Names': 'Arya','Age':26,'Gender':'Female'}]
my_df = pd.DataFrame(Ages)
my_df

      Names  Age  Gender
0      Arun   26    Male
1     Biben   25    Male
2       Geo   25    Male
3     Joyal   26    Male
4  Shenfeer   24    Male
5    Shebin   24    Male
6      Arya   26  Female